# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name typical -cap_table {./nandgate/osu_soc/lib/files/gscl45nm.tlf} -T {25}
create_library_set -name libs_typical -timing {./nandgate/osu_soc/lib/files/gscl45nm.lib}
create_constraint_mode -name constraints_default -sdc_files {./counter/Syn/Post_Sythn_Results/counter_post_synth.sdc}
create_delay_corner -name delay_default -rc_corner {typical} -early_library_set {libs_typical} -late_library_set {libs_typical}
create_analysis_view -name analysis_default -constraint_mode {constraints_default} -delay_corner {delay_default}
set_analysis_view -setup {analysis_default} -hold {analysis_default}
